huskyroboticsteam/Hand_Board_PY2023/HandBoard_Rev1.cydsn/Generated_Source/PSoC4/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "Pin_Direction.h"
#include "Pin_Direction_aliases.h"
#include "isr_Limit_1.h"
#include "Pin_Limit_1.h"
#include "Pin_Limit_1_aliases.h"
#include "Pin_Limit_2.h"
#include "Pin_Limit_2_aliases.h"
#include "Pin_Encoder_A.h"
#include "Pin_Encoder_A_aliases.h"
#include "Status_Reg_Switches.h"
#include "Clock_2.h"
#include "RX_1.h"
#include "RX_1_aliases.h"
#include "TX_1.h"
#include "TX_1_aliases.h"
#include "CAN.h"
#include "UART.h"
#include "UART_SPI_UART.h"
#include "UART_PINS.h"
#include "UART_SPI_UART_PVT.h"
#include "UART_PVT.h"
#include "UART_BOOT.h"
#include "Can_addr.h"
#include "Dip_1.h"
#include "Dip_1_aliases.h"
#include "Dip_2.h"
#include "Dip_2_aliases.h"
#include "Dip_3.h"
#include "Dip_3_aliases.h"
#include "Dip_4.h"
#include "Dip_4_aliases.h"
#include "Pin_Limit_3.h"
#include "Pin_Limit_3_aliases.h"
#include "PWM_Motor.h"
#include "Clock_PWM_1.h"
#include "Pin_Motor_1.h"
#include "Pin_Motor_1_aliases.h"
#include "timer_clock.h"
#include "Timer_PWM.h"
#include "QuadDec.h"
#include "QuadDec_PVT.h"
#include "ADC_SAR_Seq_1.h"
#include "Pin_Pot.h"
#include "Pin_Pot_aliases.h"
#include "isr_period_PWM.h"
#include "Pin_Encoder_A_1.h"
#include "Pin_Encoder_A_1_aliases.h"
#include "Pin_Encoder_B.h"
#include "Pin_Encoder_B_aliases.h"
#include "Pin_Encoder_Z.h"
#include "Pin_Encoder_Z_aliases.h"
#include "Pin_Direction_1.h"
#include "Pin_Direction_1_aliases.h"
#include "ERROR_LED.h"
#include "ERROR_LED_aliases.h"
#include "DEBUG_LED_1.h"
#include "DEBUG_LED_1_aliases.h"
#include "CAN_LED.h"
#include "CAN_LED_aliases.h"
#include "FAULT_MOTOR.h"
#include "FAULT_MOTOR_aliases.h"
#include "DEBUG_LED_2.h"
#include "DEBUG_LED_2_aliases.h"
#include "CAN_isr.h"
#include "CAN_HFCLK.h"
#include "UART_SCBCLK.h"
#include "UART_tx.h"
#include "UART_tx_aliases.h"
#include "UART_SCB_IRQ.h"
#include "UART_rx.h"
#include "UART_rx_aliases.h"
#include "QuadDec_isr.h"
#include "QuadDec_Cnt16.h"
#include "ADC_SAR_Seq_1_IRQ.h"
#include "ADC_SAR_Seq_1_intClock.h"
#include "core_cm0_psoc4.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cyPm.h"
#include "cytypes.h"
#include "cypins.h"
#include "CyDMA.h"
#include "CyLFClk.h"
#include "cy_em_eeprom.h"

/*[]*/

